import "./ShortCourses.css";

function ShortCourses(): JSX.Element {
    return (
        <div className="ShortCourses">
            <p>סדנאות ממוקדות:
                הסדנאות כוללות שלושה עד חמישה מפגשים, קיימת אפשרות לסדנה חד פעמית. 
                בסדנה נעסוק בתכנים כגון:
                מיומנויות חברתיות
                ויסות רגשי והתנהגותי
                העצמה אישית ומנהיגות
                התמודדות עם שינויים
                פיתוח וחיזוק תחושת מסוגלות אישית
                כלים לניהול כעסים
                במהלך הסדנה נתמקד באחד או יותר מהנושאים הנ"ל. נעשה זאת באופן חוויתי ומהנה תוך שילוב התנסויות באומנות לחימה, משחקים חברתיים, מתודות שונות ושיח רגשי קבוצתי.
                ישנה אפשרות לבנות סדנה ייחודית בעלת תוכן אחר המותאם לצורך העולה מהאוכלוסייה עבורה מיועדת הסדנה.  
                הסדנאות מיועדות לילדים, בני נוער וצעירים בגילאי 6-21, כאשר התכנים מותאמים לגיל הספציפי של המשתתפים.ות. 
            </p>
            <p>תקופת ההתבגרות הינה מורכבת ובעלת אתגרים רבים. כל אחד ואחת מתמודדים עם קושי ולקבוצת השווים יש את הכוח להוות תמיכה ועזרה אחד לשנייה.
                השילוב בין אומנות לחימה ושיח רגשי קבוצתי מאפשר למשתתפים.ות להוריד מעט את החסמים, להתבונן פנימה לתוך עצמם, להתמודד עם כל מה שיצוף ולתמוך אחד בשנייה. 
                נתראה בסדנה הבאה!
            </p>
        </div>
    );
}

export default ShortCourses;
